Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX5112MTG128.atdf
        <register caption="Maintenance Register 0" name="CMCC_MAINT0" offset="0x20" rw="W" size="4">
          <bitfield caption="Cache Controller Invalidate All" mask="0x00000001" name="INVALL"/>
        </register>
        <register caption="Maintenance Register 1" name="CMCC_MAINT1" offset="0x24" rw="W" size="4">
          <bitfield caption="Invalidate Index" mask="0x000007F0" name="INDEX"/>
          <bitfield caption="Invalidate Way" mask="0xC0000000" name="WAY" values="CMCC_MAINT1__WAY"/>
        </register>
        <register caption="Monitor Configuration Register" name="CMCC_MCFG" offset="0x28" rw="RW" size="4">
          <bitfield caption="Cache Controller Monitor Counter Mode" mask="0x00000003" name="MODE" values="CMCC_MCFG__MODE"/>
        </register>
        <register caption="Monitor Enable Register" name="CMCC_MEN" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Cache Controller Monitor Enable" mask="0x00000001" name="MENABLE"/>
        </register>
        <register caption="Monitor Control Register" name="CMCC_MCTRL" offset="0x30" rw="W" size="4">
          <bitfield caption="Monitor" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Monitor Status Register" name="CMCC_MSR" offset="0x34" rw="R" size="4">
          <bitfield caption="Monitor Event Counter" mask="0xFFFFFFFF" name="EVENT_CNT"/>
        </register>
        <register caption="Write Protection Mode Register" name="CMCC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Configuration Enable" mask="0x00000001" name="WPCFG"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCR"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="CMCC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Number of Ways" name="CMCC_TYPE__WAYNUM">
        <value caption="Direct Mapped Cache" name="DMAPPED" value="0x0"/>
        <value caption="2-way set associative" name="ARCH2WAY" value="0x1"/>
        <value caption="4-way set associative" name="ARCH4WAY" value="0x2"/>
        <value caption="8-way set associative" name="ARCH8WAY" value="0x3"/>
      </value-group>
      <value-group caption="Data Cache Size" name="CMCC_TYPE__CSIZE">
        <value caption="Cache size is 1 Kbyte" name="CSIZE_1KB" value="0x0"/>
        <value caption="Cache size is 2 Kbytes" name="CSIZE_2KB" value="0x1"/>
        <value caption="Cache size is 4 Kbytes" name="CSIZE_4KB" value="0x2"/>
        <value caption="Cache size is 8 Kbytes" name="CSIZE_8KB" value="0x3"/>
        <value caption="Cache size is 16 Kbytes" name="CSIZE_16KB" value="0x4"/>
        <value caption="Cache size is 32 Kbytes" name="CSIZE_32KB" value="0x5"/>
        <value caption="Cache size is 64 Kbytes" name="CSIZE_64KB" value="0x6"/>
      </value-group>
      <value-group caption="Cache LIne Size" name="CMCC_TYPE__CLSIZE">
        <value caption="Cache line size is 4 bytes" name="CLSIZE_1KB" value="0x0"/>
        <value caption="Cache line size is 8 bytes" name="CLSIZE_2KB" value="0x1"/>
        <value caption="Cache line size is 16 bytes" name="CLSIZE_4KB" value="0x2"/>
        <value caption="Cache line size is 32 bytes" name="CLSIZE_8KB" value="0x3"/>
      </value-group>
      <value-group caption="Invalidate Way" name="CMCC_MAINT1__WAY">
        <value caption="Way 0 is selection for index invalidation." name="WAY0" value="0x0"/>
        <value caption="Way 1 is selection for index invalidation." name="WAY1" value="0x1"/>
        <value caption="Way 2 is selection for index invalidation." name="WAY2" value="0x2"/>
        <value caption="Way 3 is selection for index invalidation." name="WAY3" value="0x3"/>
      </value-group>
      <value-group caption="Cache Controller Monitor Counter Mode" name="CMCC_MCFG__MODE">
        <value caption="Cycle counter" name="CYCLE_COUNT" value="0x0"/>
        <value caption="Instruction hit counter, only relevant for unified cache and instruction cache architecture" name="IHIT_COUNT" value="0x1"/>
        <value caption="Data hit counter, only relevant for unified cache and data cache architecture" name="DHIT_COUNT" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="CMCC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPCFG and WPCR bits. Always reads as 0." name="PASSWD" value="0x434D43"/>
      </value-group>
    </module>
    <module caption="Classic Public Key Cryptography Controller" name="CPKCC" id="44163" version="B">
      <register-group name="CPKCC">
        <register caption="R Parameter Register" name="CPKCC_R" offset="0x00" rw="RW" size="4">
          <bitfield caption="CPKCC_R value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="X Parameter Register" name="CPKCC_X" offset="0x04" rw="RW" size="4">
          <bitfield caption="CPKCC_X value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="Y Parameter Register" name="CPKCC_Y" offset="0x08" rw="RW" size="4">
          <bitfield caption="CPKCC_Y value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="Z Parameter Register" name="CPKCC_Z" offset="0x0C" rw="RW" size="4">
          <bitfield caption="CPKCC_Z value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="J Parameter Register" name="CPKCC_J" offset="0x10" rw="RW" size="4">
          <bitfield caption="CPKCC_J value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="K Parameter Register" name="CPKCC_K" offset="0x14" rw="RW" size="4">
          <bitfield caption="CPKCC_K value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="N Parameter Register" name="CPKCC_N" offset="0x18" rw="RW" size="4">
          <bitfield caption="CPKCC_N value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="SMULA Register" name="CPKCC_SMULA" offset="0x1C" rw="RW" size="4">
          <bitfield caption="CPKCC_SMULA value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
