Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX5112MTG128.atdf
      <value-group caption="Password" name="WDT1_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="Prescaler Ratio" name="WDT1_IL__PRESC">
        <value caption="The watchdog counter decreased when the prescaler reaches 128." name="RATIO128" value="0x0"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 64." name="RATIO64" value="0x1"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 32." name="RATIO32" value="0x2"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 16." name="RATIO16" value="0x3"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 8." name="RATIO8" value="0x4"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 4." name="RATIO4" value="0x5"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 2." name="RATIO2" value="0x6"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 1." name="RATIO1" value="0x7"/>
      </value-group>
      <value-group caption="Password" name="WDT0_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="Prescaler Ratio" name="WDT0_IL__PRESC">
        <value caption="The watchdog counter decreased when the prescaler reaches 128." name="RATIO128" value="0x0"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 64." name="RATIO64" value="0x1"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 32." name="RATIO32" value="0x2"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 16." name="RATIO16" value="0x3"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 8." name="RATIO8" value="0x4"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 4." name="RATIO4" value="0x5"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 2." name="RATIO2" value="0x6"/>
        <value caption="The watchdog counter decreased when the prescaler reaches 1." name="RATIO1" value="0x7"/>
      </value-group>
    </module>
    <module caption="Flexible Serial Communication" name="FLEXCOM" id="11268" version="ZH">
      <register-group name="FLEXCOM">
        <register caption="FLEXCOM Mode Register" name="FLEX_MR" offset="0x000" rw="RW" size="4">
          <bitfield caption="FLEXCOM Operating Mode" mask="0x00000003" name="OPMODE" values="FLEX_MR__OPMODE"/>
        </register>
        <register caption="FLEXCOM Receive Holding Register" name="FLEX_RHR" offset="0x010" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RXDATA"/>
        </register>
        <register caption="FLEXCOM Transmit Holding Register" name="FLEX_THR" offset="0x020" rw="RW" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TXDATA"/>
        </register>
        <register caption="Receive Pointer Register" name="FLEX_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="FLEX_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="FLEX_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="FLEX_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="FLEX_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="FLEX_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="FLEX_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="FLEX_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="FLEX_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="FLEX_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
        <register caption="Write Protection Mode Register" name="FLEX_PWPMR" offset="0x128" rw="RW" size="4">
          <bitfield caption="Write Protection Pointer Registers Enable" mask="0x00000001" name="WPPTREN"/>
          <bitfield caption="Write Protection Counter Registers Enable" mask="0x00000002" name="WPCTREN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="FLEX_PWPMR__WPKEY"/>
        </register>
