Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX5112MTG128.atdf
        <register caption="Main Clock Frequency Register" name="CKGR_MCFR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="Main Clock Frequency" mask="0x0000FFFF" name="MAINF"/>
          <bitfield caption="Main Clock Frequency Measure Ready" mask="0x00010000" name="MAINFRDY"/>
          <bitfield caption="RC Oscillator Frequency Measure (write-only)" mask="0x00100000" name="RCMEAS"/>
          <bitfield caption="Counter Clock Source Selection" mask="0x01000000" name="CCSS"/>
        </register>
        <register caption="CPU Clock Register" name="PMC_CPU_CKR" offset="0x002C" rw="RW" size="4">
          <bitfield caption="Processor (CPU_CLK0) and Master Clock (MCK0) Source Selection" mask="0x00000003" name="CSS" values="PMC_CPU_CKR__CSS"/>
          <bitfield caption="Processor (CPU_CLK0) and Master Clock (MCK0) Prescaler" mask="0x00000070" name="PRES" values="PMC_CPU_CKR__PRES"/>
          <bitfield caption="Coprocessor MCK1 Source Selection" mask="0x00070000" name="CPCSS" values="PMC_CPU_CKR__CPCSS"/>
          <bitfield caption="Coprocessor MCK1 Prescaler" mask="0x00F00000" name="CPPRES" values="PMC_CPU_CKR__CPPRES"/>
          <bitfield caption="MCK0 Clock Frequency Division for MCK0DIV Clock" mask="0x01000000" name="RATIO_MCK0DIV"/>
          <bitfield caption="MCK1 Clock Frequency Division for MCK1DIV Clock" mask="0x02000000" name="RATIO_MCK1DIV"/>
          <bitfield caption="MCK0 Clock Frequency Division for MCK0DIV2 Clock" mask="0x04000000" name="RATIO_MCK0DIV2"/>
        </register>
        <register caption="Programmable Clock Register (chid = 0)" name="PMC_PCK" offset="0x44" rw="RW" size="4" count="3">
          <bitfield caption="Programmable Clock Source Selection" mask="0x0000001F" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x0000FF00" name="PRES"/>
        </register>
        <register caption="Interrupt Enable Register" name="PMC_IER" offset="0x0064" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Enable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="Master Clock 0 Ready Interrupt Enable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Coprocessor Master Clock Ready Interrupt Enable" mask="0x00000010" name="CPMCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Enable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Enable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Enable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready 3 Interrupt Enable" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Main Clock Source Oscillator Selection Status Interrupt Enable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main RC Oscillator Status Interrupt Enable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Enable" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="32.768 kHz Crystal Oscillator Error Interrupt Enable" mask="0x00200000" name="XT32KERR"/>
          <bitfield caption="Master Clock 0 Clock Monitor Interrupt Enable" mask="0x00800000" name="MCKMON"/>
        </register>
        <register caption="Interrupt Disable Register" name="PMC_IDR" offset="0x0068" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Disable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="Master Clock 0 Ready Interrupt Disable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Coprocessor Master Clock Ready Interrupt Disable" mask="0x00000010" name="CPMCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt DIsable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt DIsable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt DIsable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready 3 Interrupt DIsable" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Main Clock Source Oscillator Selection Status Interrupt Disable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main RC Status Interrupt Disable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Disable" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="32.768 kHz Crystal Oscillator Error Interrupt Disable" mask="0x00200000" name="XT32KERR"/>
          <bitfield caption="Master Clock 0 Clock Monitor Interrupt Disable" mask="0x00800000" name="MCKMON"/>
        </register>
        <register caption="Status Register" name="PMC_SR" offset="0x006C" rw="R" size="4">
          <bitfield caption="Main Crystal Oscillator Status" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="Master Clock 0 Status" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Coprocessor Master Clock Status" mask="0x00000010" name="CPMCKRDY"/>
          <bitfield caption="Monitoring Domain Slow Clock Source Oscillator Selection" mask="0x00000080" name="OSCSELS"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Main Clock Source Oscillator Selection Status" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main RC Oscillator Status" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Clock Failure Detector Status" mask="0x00080000" name="CFDS"/>
          <bitfield caption="Clock Failure Detector Fault Output Status" mask="0x00100000" name="FOS"/>
          <bitfield caption="Slow Crystal Oscillator Error" mask="0x00200000" name="XT32KERR"/>
          <bitfield caption="Master Clock 0 Clock Monitor Error" mask="0x00800000" name="MCKMON"/>
          <bitfield caption="GCLK Ready" mask="0x01000000" name="GCLKRDY"/>
          <bitfield caption="PLL Interrupt Status" mask="0x02000000" name="PLL_INT"/>
        </register>
        <register caption="Interrupt Mask Register" name="PMC_IMR" offset="0x0070" rw="R" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Mask" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="Master Clock 0 Ready Interrupt Mask" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Coprocessor Master Clock Ready Interrupt Mask" mask="0x00000010" name="CPMCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Mask" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Mask" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Mask" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready 3 Interrupt Mask" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Main Clock Source Oscillator Selection Status Interrupt Mask" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main RC Status Interrupt Mask" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Mask" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="32.768 kHz Crystal Oscillator Error Interrupt Mask" mask="0x00200000" name="XT32KERR"/>
          <bitfield caption="Master Clock 0 Monitor Error Interrupt Mask" mask="0x00800000" name="MCKMON"/>
        </register>
