Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX5112MTG128.atdf
      <value-group caption="High Duration of the Output Pulse" name="RTC_MR__THIGH">
        <value caption="31.2 ms" name="H_31MS" value="0x0"/>
        <value caption="15.6 ms" name="H_16MS" value="0x1"/>
        <value caption="3.91 ms" name="H_4MS" value="0x2"/>
        <value caption="976 us" name="H_976US" value="0x3"/>
        <value caption="488 us" name="H_488US" value="0x4"/>
        <value caption="122 us" name="H_122US" value="0x5"/>
        <value caption="30.5 us" name="H_30US" value="0x6"/>
        <value caption="15.2 us" name="H_15US" value="0x7"/>
      </value-group>
      <value-group caption="Period of the Output Pulse" name="RTC_MR__TPERIOD">
        <value caption="1 second" name="P_1S" value="0x0"/>
        <value caption="500 ms" name="P_500MS" value="0x1"/>
        <value caption="250 ms" name="P_250MS" value="0x2"/>
        <value caption="125 ms" name="P_125MS" value="0x3"/>
      </value-group>
      <value-group caption="Ante Meridiem Post Meridiem Indicator" name="RTC_TIMR__AMPM">
        <value caption="AM." name="AM" value="0"/>
        <value caption="PM." name="PM" value="1"/>
      </value-group>
      <value-group caption="Second Alarm Enable" name="RTC_TIMALR__SECEN">
        <value caption="The second-matching alarm is disabled." name="DISABLED" value="0"/>
        <value caption="The second-matching alarm is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Minute Alarm Enable" name="RTC_TIMALR__MINEN">
        <value caption="The minute-matching alarm is disabled." name="DISABLED" value="0"/>
        <value caption="The minute-matching alarm is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Hour Alarm Enable" name="RTC_TIMALR__HOUREN">
        <value caption="The hour-matching alarm is disabled." name="DISABLED" value="0"/>
        <value caption="The hour-matching alarm is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Month Alarm Enable" name="RTC_CALALR__MTHEN">
        <value caption="The month-matching alarm is disabled." name="DISABLED" value="0"/>
        <value caption="The month-matching alarm is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Date Alarm Enable" name="RTC_CALALR__DATEEN">
        <value caption="The date-matching alarm is disabled." name="DISABLED" value="0"/>
        <value caption="The date-matching alarm is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="UTC Alarm Enable" name="RTC_CALALR_UTC_MODE__UTCEN">
        <value caption="The UTC-matching alarm is disabled." name="DISABLED" value="0"/>
        <value caption="The UTC-matching alarm is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Acknowledge for Update" name="RTC_SR__ACKUPD">
        <value caption="Time and calendar registers cannot be updated." name="FREERUN" value="0"/>
        <value caption="Time and calendar registers can be updated." name="UPDATE" value="1"/>
      </value-group>
      <value-group caption="Alarm Flag" name="RTC_SR__ALARM">
        <value caption="No alarm matching condition occurred." name="NO_ALARMEVENT" value="0"/>
        <value caption="An alarm matching condition has occurred." name="ALARMEVENT" value="1"/>
      </value-group>
      <value-group caption="Second Event" name="RTC_SR__SEC">
        <value caption="No second event has occurred since the last clear." name="NO_SECEVENT" value="0"/>
        <value caption="At least one second event has occurred since the last clear." name="SECEVENT" value="1"/>
      </value-group>
      <value-group caption="Time Event" name="RTC_SR__TIMEV">
        <value caption="No time event has occurred since the last clear." name="NO_TIMEVENT" value="0"/>
        <value caption="At least one time event has occurred since the last clear." name="TIMEVENT" value="1"/>
      </value-group>
      <value-group caption="Calendar Event" name="RTC_SR__CALEV">
        <value caption="No calendar event has occurred since the last clear." name="NO_CALEVENT" value="0"/>
        <value caption="At least one calendar event has occurred since the last clear." name="CALEVENT" value="1"/>
      </value-group>
      <value-group caption="Time and/or Date Free Running Error" name="RTC_SR__TDERR">
        <value caption="The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR)." name="CORRECT" value="0"/>
        <value caption="The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid." name="ERR_TIMEDATE" value="1"/>
      </value-group>
      <value-group caption="Timestamping on TMPx input is enabled" name="RTC_TCR__TAMPEN0">
        <value caption="Tamper event on TMPx input is not timestamped." name="TIMESTAMP_OFF" value="0"/>
        <value caption="Tamper event on TMPx input is timestamped." name="TIMESTAMP_ON" value="1"/>
      </value-group>
      <value-group caption="Timestamping on TMPx input is enabled" name="RTC_TCR__TAMPEN1">
        <value caption="Tamper event on TMPx input is not timestamped." name="TIMESTAMP_OFF" value="0"/>
        <value caption="Tamper event on TMPx input is timestamped." name="TIMESTAMP_ON" value="1"/>
      </value-group>
      <value-group caption="Timestamping on TMPx input is enabled" name="RTC_TCR__TAMPEN2">
        <value caption="Tamper event on TMPx input is not timestamped." name="TIMESTAMP_OFF" value="0"/>
        <value caption="Tamper event on TMPx input is timestamped." name="TIMESTAMP_ON" value="1"/>
      </value-group>
      <value-group caption="Timestamping on TMPx input is enabled" name="RTC_TCR__TAMPEN3">
        <value caption="Tamper event on TMPx input is not timestamped." name="TIMESTAMP_OFF" value="0"/>
        <value caption="Tamper event on TMPx input is timestamped." name="TIMESTAMP_ON" value="1"/>
      </value-group>
      <value-group caption="Timestamping on TMPx input is enabled" name="RTC_TCR__TAMPEN4">
        <value caption="Tamper event on TMPx input is not timestamped." name="TIMESTAMP_OFF" value="0"/>
        <value caption="Tamper event on TMPx input is timestamped." name="TIMESTAMP_ON" value="1"/>
      </value-group>
      <value-group caption="Tamper Clear" name="RTC_TCR__TAMPCLR">
        <value caption="A Tamper event does not create an immediate clear on GPBR registers." name="NOT_ENABLE" value="0"/>
        <value caption="Tamper event on TMP0 or TMP4 generates an immediate clear on GPBR registers. The number of cleared GPBR registers depends on the value of FGPBRCLR." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Full GPBR Clear" name="RTC_TCR__FGPBRCLR">
        <value caption="If TAMPCLR is set to '1', a tamper event immediately clears GPBR0 to GPBR11." name="HALF" value="0"/>
        <value caption="If TAMPCLR is set to '1', a tamper event immediately clears all GPBRs." name="FULL" value="1"/>
      </value-group>
    </module>
    <module caption="Real-time Timer" name="RTT" id="6081" version="Q">
      <register-group name="RTT">
        <register caption="Mode Register" name="RTT_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Real-time Timer Prescaler Value" mask="0x0000FFFF" name="RTPRES"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00010000" name="ALMIEN"/>
          <bitfield caption="Real-time Timer Increment Interrupt Enable" mask="0x00020000" name="RTTINCIEN"/>
          <bitfield caption="Real-time Timer Restart" mask="0x00040000" name="RTTRST"/>
          <bitfield caption="Real-time Timer Disable" mask="0x00100000" name="RTTDIS"/>
          <bitfield caption="RTTINC2 Alarm and Interrupt Enable" mask="0x00200000" name="INC2AEN"/>
          <bitfield caption="Real-Time Clock 1Hz Clock Selection" mask="0x01000000" name="RTC1HZ"/>
        </register>
        <register caption="Alarm Register" name="RTT_AR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Alarm Value" mask="0xFFFFFFFF" name="ALMV"/>
        </register>
        <register caption="Value Register" name="RTT_VR" offset="0x08" rw="R" size="4">
          <bitfield caption="Current Real-time Value" mask="0xFFFFFFFF" name="CRTV"/>
        </register>
        <register caption="Status Register" name="RTT_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Real-time Alarm Status (cleared on read)" mask="0x00000001" name="ALMS"/>
          <bitfield caption="Prescaler Roll-over Status (cleared on read)" mask="0x00000002" name="RTTINC"/>
          <bitfield caption="Predefined Number of Prescaler Roll-overs Status (cleared on read)" mask="0x00000004" name="RTTINC2"/>
        </register>
        <register caption="Modulo Selection Register" name="RTT_MODR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Selection of the 32-bit Counter Modulo to generate RTTINC2 Flag" mask="0x00000007" name="SELINC2" values="RTT_MODR__SELINC2"/>
        </register>
      </register-group>
      <value-group caption="Selection of the 32-bit Counter Modulo to generate RTTINC2 Flag" name="RTT_MODR__SELINC2">
        <value caption="The RTTINC2 flag never rises" name="NO_RTTINC2" value="0x0"/>
        <value caption="The RTTINC2 flag is set when CRTV modulo 64 equals 0" name="MOD64" value="0x1"/>
        <value caption="The RTTINC2 flag is set when CRTV modulo 128 equals 0" name="MOD128" value="0x2"/>
        <value caption="The RTTINC2 flag is set when CRTV modulo 256 equals 0" name="MOD256" value="0x3"/>
        <value caption="The RTTINC2 flag is set when CRTV modulo 512 equals 0" name="MOD512" value="0x4"/>
        <value caption="The RTTINC2 flag is set when CRTV modulo 1024 equals 0. Example: If RTPRES=32 then RTTINC2 flag rises once per second if the slow clock is 32.768 kHz." name="MOD1024" value="0x5"/>
        <value caption="The RTTINC2 flag is set when CRTV modulo 2048 equals 0" name="MOD2048" value="0x6"/>
        <value caption="The RTTINC2 flag is set when CRTV modulo 4096 equals 0" name="MOD4096" value="0x7"/>
      </value-group>
    </module>
    <module caption="Secure Embedded Flash Controller" name="SEFC" id="04463" version="F">
      <register-group name="SEFC">
        <register caption="SEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Flash Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Code Loop Optimization Enable" mask="0x04000000" name="CLOE"/>
          <bitfield caption="Always Written to One" mask="0x08000000" name="ALWAYS1"/>
        </register>
        <register caption="SEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="SEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status (cleared when Flash is busy)" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status (cleared on read)" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status (cleared on read or by writing EEFC_FCR)" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status (cleared when a programming operation starts)" mask="0x00000008" name="FLERR"/>
          <bitfield caption="Write Protection Error Status (cleared on read)" mask="0x00000010" name="WPERR"/>
          <bitfield caption="Flash Suspended Status (cleared when resuming the programming operation)" mask="0x00000020" name="FLSUSP"/>
          <bitfield caption="Single ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00010000" name="SECCELSBD"/>
          <bitfield caption="Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00020000" name="MECCELSBD"/>
          <bitfield caption="Single ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00040000" name="SECCEMSBD"/>
          <bitfield caption="Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00080000" name="MECCEMSBD"/>
          <bitfield caption="Single ECC Error on LSB Part of the Memory Lock Bits" mask="0x00100000" name="SECCELSBL"/>
          <bitfield caption="Multiple ECC Error on LSB Part of the Memory Lock Bits" mask="0x00200000" name="MECCELSBL"/>
          <bitfield caption="Single ECC Error on MSB Part of the Memory Lock Bits" mask="0x00400000" name="SECCEMSBL"/>
          <bitfield caption="Multiple ECC Error on MSB Part of the Memory Lock Bits" mask="0x00800000" name="MECCEMSBL"/>
        </register>
        <register caption="SEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
