Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX5112MTG128.atdf
        <register caption="Extended Mode Register" name="SUPC_EMR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Flash Erase GPBR" mask="0x00010000" name="FLRSGPBR"/>
          <bitfield caption="Full GPBR Clean" mask="0x00020000" name="FULLGPBRC"/>
          <bitfield caption="VDDCORE Voltage Regulator Bandgap Enable" mask="0x00040000" name="COREBGEN"/>
        </register>
        <register caption="Backup Mode Register" name="SUPC_BMR" offset="0x20" rw="RW" size="4">
          <bitfield caption="Real-time Timer Wake-up Enable" mask="0x00000001" name="RTTWKEN" values="SUPC_BMR__RTTWKEN"/>
          <bitfield caption="Real-time Clock Wake-up Enable" mask="0x00000002" name="RTCWKEN" values="SUPC_BMR__RTCWKEN"/>
          <bitfield caption="VBAT Supply Monitor Wake-up Enable" mask="0x00000004" name="VBATWKEN" values="SUPC_BMR__VBATWKEN"/>
          <bitfield caption="Force Wake-up Pin Wake-up Enable" mask="0x00000010" name="FWUPEN" values="SUPC_BMR__FWUPEN"/>
          <bitfield caption="VDDCORE POR Wake-up Enable" mask="0x00000020" name="CORPORWKEN" values="SUPC_BMR__CORPORWKEN"/>
          <bitfield caption="VDD3V3 Supply Monitor Wake-up Enable" mask="0x00000040" name="VDD3V3SMWKEN" values="SUPC_BMR__VDD3V3SMWKEN"/>
          <bitfield caption="Battery Voltage Event Report Enable" mask="0x00000100" name="VBATREN" values="SUPC_BMR__VBATREN"/>
          <bitfield caption="RTCOUT0 Outputs Drive Mode" mask="0x00000200" name="MRTCOUT" values="SUPC_BMR__MRTCOUT"/>
          <bitfield caption="Slow Crystal Oscillator Frequency Error Wake-up Enable" mask="0x00000400" name="BADXTWKEN"/>
          <bitfield caption="Password Key" mask="0xFF000000" name="KEY" values="SUPC_BMR__KEY"/>
        </register>
        <register caption="Wakeup Status Register" name="SUPC_WUSR" offset="0x24" rw="R" size="4">
          <bitfield caption="WKUP Wake-up Status (cleared on read)" mask="0x00000001" name="WKUPS"/>
          <bitfield caption="Slow Crystal Oscillator Frequency Error Wake-up Status (cleared on read)" mask="0x00000002" name="BADXTWKS"/>
          <bitfield caption="FWUP Wake-up Status (cleared on read)" mask="0x00000004" name="FWUPS"/>
          <bitfield caption="VDD3V3 Supply Monitor Wake-up Status (cleared on read)" mask="0x00000008" name="VDD3V3SMWS"/>
          <bitfield caption="RTT Wake-up Status (cleared on read)" mask="0x00000010" name="RTTS"/>
          <bitfield caption="RTC Wake-up Status (cleared on read)" mask="0x00000020" name="RTCS"/>
          <bitfield caption="VDD3V3 Supply Monitor Reset Status (cleared on read)" mask="0x00000100" name="VDD3V3SMRSTS"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x00010000" name="WKUPIS0"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x00020000" name="WKUPIS1"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x00040000" name="WKUPIS2"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x00080000" name="WKUPIS3"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x00100000" name="WKUPIS4"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x00200000" name="WKUPIS5"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x00400000" name="WKUPIS6"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x00800000" name="WKUPIS7"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x01000000" name="WKUPIS8"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x02000000" name="WKUPIS9"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x04000000" name="WKUPIS10"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x08000000" name="WKUPIS11"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x10000000" name="WKUPIS12"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x20000000" name="WKUPIS13"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x40000000" name="WKUPIS14"/>
          <bitfield caption="WKUPx Input Wake-up Status (cleared on read)" mask="0x80000000" name="WKUPIS15"/>
        </register>
        <register caption="Enable Interrupt Register" name="SUPC_IER" offset="0x28" rw="W" size="4">
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Enable" mask="0x00000001" name="LPDBC0"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Enable" mask="0x00000002" name="LPDBC1"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Enable" mask="0x00000004" name="LPDBC2"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Enable" mask="0x00000008" name="LPDBC3"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Enable" mask="0x00000010" name="LPDBC4"/>
          <bitfield caption="VDD3V3 Supply Monitor Event Interrupt Enable" mask="0x00010000" name="VDD3V3SMEV"/>
          <bitfield caption="VBAT Supply Monitor Event Interrupt Enable" mask="0x00020000" name="VBATSMEV"/>
        </register>
        <register caption="Disable Interrupt Register" name="SUPC_IDR" offset="0x2C" rw="W" size="4">
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Disable" mask="0x00000001" name="LPDBC0"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Disable" mask="0x00000002" name="LPDBC1"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Disable" mask="0x00000004" name="LPDBC2"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Disable" mask="0x00000008" name="LPDBC3"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Disable" mask="0x00000010" name="LPDBC4"/>
          <bitfield caption="VDD3V3 Supply Monitor Event Interrupt Disable" mask="0x00010000" name="VDD3V3SMEV"/>
          <bitfield caption="VBAT Supply Monitor Event Interrupt Disable" mask="0x00020000" name="VBATSMEV"/>
        </register>
        <register caption="Mask Interrupt Register" name="SUPC_IMR" offset="0x30" rw="R" size="4">
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Mask" mask="0x00000001" name="LPDBC0"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Mask" mask="0x00000002" name="LPDBC1"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Mask" mask="0x00000004" name="LPDBC2"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Mask" mask="0x00000008" name="LPDBC3"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Mask" mask="0x00000010" name="LPDBC4"/>
          <bitfield caption="VDD3V3 Supply Monitor Event Interrupt Mask" mask="0x00010000" name="VDD3V3SMEV"/>
          <bitfield caption="VBAT Supply Monitor Event Interrupt Mask" mask="0x00020000" name="VBATSMEV"/>
        </register>
        <register caption="Status Interrupt Register" name="SUPC_ISR" offset="0x34" rw="R" size="4">
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Status (cleared on read)" mask="0x00000001" name="LPDBC0"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Status (cleared on read)" mask="0x00000002" name="LPDBC1"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Status (cleared on read)" mask="0x00000004" name="LPDBC2"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Status (cleared on read)" mask="0x00000008" name="LPDBC3"/>
          <bitfield caption="WKUPx Pin Tamper Detection Interrupt Status (cleared on read)" mask="0x00000010" name="LPDBC4"/>
          <bitfield caption="VDD3V3 Supply Monitor Event Interrupt Status (cleared on read)" mask="0x00010000" name="VDD3V3SMEV"/>
          <bitfield caption="VBAT Supply Monitor Event Interrupt Status (cleared on read)" mask="0x00020000" name="VBATSMEV"/>
        </register>
      </register-group>
      <value-group caption="Voltage Regulator Off" name="SUPC_CR__VROFF">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY=0xA5, VROFF asserts the VDDCORE domain reset and stops the voltage regulator." name="STOP_VREG" value="1"/>
      </value-group>
      <value-group caption="Timing Domain Slow Clock Selector" name="SUPC_CR__TDXTALSEL">
        <value caption="Slow clock of the timing domain is driven by the embedded 32 kHz (typical) RC oscillator." name="RC" value="0"/>
        <value caption="Slow clock of the timing domain is driven by the 32.768 kHz crystal oscillator." name="XTAL" value="1"/>
      </value-group>
      <value-group caption="Password" name="SUPC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="VDD3V3 Supply Monitor Sampling Period" name="SUPC_SMMR__VDD3V3SMSMPL">
        <value caption="VDD3V3 supply monitor is disabled" name="DISABLED" value="0x0"/>
        <value caption="Continuous VDD3V3 supply monitoring" name="ALWAYS_ON" value="0x1"/>
        <value caption="VDD3V3 supply monitor is enabled for 1 period every 32 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied." name="_32SLCK" value="0x2"/>
        <value caption="VDD3V3 supply monitor is enabled for 1 period every 256 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied." name="_256SLCK" value="0x3"/>
        <value caption="VDD3V3 supply monitor is enabled for 1 period every 2048 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied." name="_2048SLCK" value="0x4"/>
      </value-group>
