Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX5112MTG128.atdf
      <value-group caption="Low-power Debouncer Period of WKUPx" name="SUPC_WUMR__LPDBC2">
        <value caption="Disables the low-power debouncers." name="DISABLE" value="0x0"/>
        <value caption="WKUPx in active state for at least 2 RTCOUTx clock periods" name="_2_RTCOUT" value="0x1"/>
        <value caption="WKUPx in active state for at least 3 RTCOUTx clock periods" name="_3_RTCOUT" value="0x2"/>
        <value caption="WKUPx in active state for at least 4 RTCOUTx clock periods" name="_4_RTCOUT" value="0x3"/>
        <value caption="WKUPx in active state for at least 5 RTCOUTx clock periods" name="_5_RTCOUT" value="0x4"/>
        <value caption="WKUPx in active state for at least 6 RTCOUTx clock periods" name="_6_RTCOUT" value="0x5"/>
        <value caption="WKUPx in active state for at least 7 RTCOUTx clock periods" name="_7_RTCOUT" value="0x6"/>
        <value caption="WKUPx in active state for at least 8 RTCOUTx clock periods" name="_8_RTCOUT" value="0x7"/>
      </value-group>
      <value-group caption="Low-power Debouncer Period of WKUPx" name="SUPC_WUMR__LPDBC3">
        <value caption="Disables the low-power debouncers." name="DISABLE" value="0x0"/>
        <value caption="WKUPx in active state for at least 2 RTCOUTx clock periods" name="_2_RTCOUT" value="0x1"/>
        <value caption="WKUPx in active state for at least 3 RTCOUTx clock periods" name="_3_RTCOUT" value="0x2"/>
        <value caption="WKUPx in active state for at least 4 RTCOUTx clock periods" name="_4_RTCOUT" value="0x3"/>
        <value caption="WKUPx in active state for at least 5 RTCOUTx clock periods" name="_5_RTCOUT" value="0x4"/>
        <value caption="WKUPx in active state for at least 6 RTCOUTx clock periods" name="_6_RTCOUT" value="0x5"/>
        <value caption="WKUPx in active state for at least 7 RTCOUTx clock periods" name="_7_RTCOUT" value="0x6"/>
        <value caption="WKUPx in active state for at least 8 RTCOUTx clock periods" name="_8_RTCOUT" value="0x7"/>
      </value-group>
      <value-group caption="Low-power Debouncer Period of WKUPx" name="SUPC_WUMR__LPDBC4">
        <value caption="Disables the low-power debouncers." name="DISABLE" value="0x0"/>
        <value caption="WKUPx in active state for at least 2 RTCOUTx clock periods" name="_2_RTCOUT" value="0x1"/>
        <value caption="WKUPx in active state for at least 3 RTCOUTx clock periods" name="_3_RTCOUT" value="0x2"/>
        <value caption="WKUPx in active state for at least 4 RTCOUTx clock periods" name="_4_RTCOUT" value="0x3"/>
        <value caption="WKUPx in active state for at least 5 RTCOUTx clock periods" name="_5_RTCOUT" value="0x4"/>
        <value caption="WKUPx in active state for at least 6 RTCOUTx clock periods" name="_6_RTCOUT" value="0x5"/>
        <value caption="WKUPx in active state for at least 7 RTCOUTx clock periods" name="_7_RTCOUT" value="0x6"/>
        <value caption="WKUPx in active state for at least 8 RTCOUTx clock periods" name="_8_RTCOUT" value="0x7"/>
      </value-group>
      <value-group caption="Wake-up Input Type 0" name="SUPC_WUIR__WKUPT0">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 1" name="SUPC_WUIR__WKUPT1">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 2" name="SUPC_WUIR__WKUPT2">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 3" name="SUPC_WUIR__WKUPT3">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 4" name="SUPC_WUIR__WKUPT4">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 5" name="SUPC_WUIR__WKUPT5">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 6" name="SUPC_WUIR__WKUPT6">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 7" name="SUPC_WUIR__WKUPT7">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 8" name="SUPC_WUIR__WKUPT8">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 9" name="SUPC_WUIR__WKUPT9">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 10" name="SUPC_WUIR__WKUPT10">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
