Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX5112MTG128.atdf
        <register caption="Lock Bits Word 2" name="LOCKBIT_WORD2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Lock Region 64" mask="0x00000001" name="LOCK_REGION_64"/>
          <bitfield caption="Lock Region 65" mask="0x00000002" name="LOCK_REGION_65"/>
          <bitfield caption="Lock Region 66" mask="0x00000004" name="LOCK_REGION_66"/>
          <bitfield caption="Lock Region 67" mask="0x00000008" name="LOCK_REGION_67"/>
          <bitfield caption="Lock Region 68" mask="0x00000010" name="LOCK_REGION_68"/>
          <bitfield caption="Lock Region 69" mask="0x00000020" name="LOCK_REGION_69"/>
          <bitfield caption="Lock Region 70" mask="0x00000040" name="LOCK_REGION_70"/>
          <bitfield caption="Lock Region 71" mask="0x00000080" name="LOCK_REGION_71"/>
          <bitfield caption="Lock Region 72" mask="0x00000100" name="LOCK_REGION_72"/>
          <bitfield caption="Lock Region 73" mask="0x00000200" name="LOCK_REGION_73"/>
          <bitfield caption="Lock Region 74" mask="0x00000400" name="LOCK_REGION_74"/>
          <bitfield caption="Lock Region 75" mask="0x00000800" name="LOCK_REGION_75"/>
          <bitfield caption="Lock Region 76" mask="0x00001000" name="LOCK_REGION_76"/>
          <bitfield caption="Lock Region 77" mask="0x00002000" name="LOCK_REGION_77"/>
          <bitfield caption="Lock Region 78" mask="0x00004000" name="LOCK_REGION_78"/>
          <bitfield caption="Lock Region 79" mask="0x00008000" name="LOCK_REGION_79"/>
          <bitfield caption="Lock Region 80" mask="0x00010000" name="LOCK_REGION_80"/>
          <bitfield caption="Lock Region 81" mask="0x00020000" name="LOCK_REGION_81"/>
          <bitfield caption="Lock Region 82" mask="0x00040000" name="LOCK_REGION_82"/>
          <bitfield caption="Lock Region 83" mask="0x00080000" name="LOCK_REGION_83"/>
          <bitfield caption="Lock Region 84" mask="0x00100000" name="LOCK_REGION_84"/>
          <bitfield caption="Lock Region 85" mask="0x00200000" name="LOCK_REGION_85"/>
          <bitfield caption="Lock Region 86" mask="0x00400000" name="LOCK_REGION_86"/>
          <bitfield caption="Lock Region 87" mask="0x00800000" name="LOCK_REGION_87"/>
          <bitfield caption="Lock Region 88" mask="0x01000000" name="LOCK_REGION_88"/>
          <bitfield caption="Lock Region 89" mask="0x02000000" name="LOCK_REGION_89"/>
          <bitfield caption="Lock Region 90" mask="0x04000000" name="LOCK_REGION_90"/>
          <bitfield caption="Lock Region 91" mask="0x08000000" name="LOCK_REGION_91"/>
          <bitfield caption="Lock Region 92" mask="0x10000000" name="LOCK_REGION_92"/>
          <bitfield caption="Lock Region 93" mask="0x20000000" name="LOCK_REGION_93"/>
          <bitfield caption="Lock Region 94" mask="0x40000000" name="LOCK_REGION_94"/>
          <bitfield caption="Lock Region 95" mask="0x80000000" name="LOCK_REGION_95"/>
        </register>
        <register caption="Lock Bits Word 3" name="LOCKBIT_WORD3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Lock Region 96" mask="0x00000001" name="LOCK_REGION_96"/>
          <bitfield caption="Lock Region 97" mask="0x00000002" name="LOCK_REGION_97"/>
          <bitfield caption="Lock Region 98" mask="0x00000004" name="LOCK_REGION_98"/>
          <bitfield caption="Lock Region 99" mask="0x00000008" name="LOCK_REGION_99"/>
          <bitfield caption="Lock Region 100" mask="0x00000010" name="LOCK_REGION_100"/>
          <bitfield caption="Lock Region 101" mask="0x00000020" name="LOCK_REGION_101"/>
          <bitfield caption="Lock Region 102" mask="0x00000040" name="LOCK_REGION_102"/>
          <bitfield caption="Lock Region 103" mask="0x00000080" name="LOCK_REGION_103"/>
          <bitfield caption="Lock Region 104" mask="0x00000100" name="LOCK_REGION_104"/>
          <bitfield caption="Lock Region 105" mask="0x00000200" name="LOCK_REGION_105"/>
          <bitfield caption="Lock Region 106" mask="0x00000400" name="LOCK_REGION_106"/>
          <bitfield caption="Lock Region 107" mask="0x00000800" name="LOCK_REGION_107"/>
          <bitfield caption="Lock Region 108" mask="0x00001000" name="LOCK_REGION_108"/>
          <bitfield caption="Lock Region 109" mask="0x00002000" name="LOCK_REGION_109"/>
          <bitfield caption="Lock Region 110" mask="0x00004000" name="LOCK_REGION_110"/>
          <bitfield caption="Lock Region 111" mask="0x00008000" name="LOCK_REGION_111"/>
          <bitfield caption="Lock Region 112" mask="0x00010000" name="LOCK_REGION_112"/>
          <bitfield caption="Lock Region 113" mask="0x00020000" name="LOCK_REGION_113"/>
          <bitfield caption="Lock Region 114" mask="0x00040000" name="LOCK_REGION_114"/>
          <bitfield caption="Lock Region 115" mask="0x00080000" name="LOCK_REGION_115"/>
          <bitfield caption="Lock Region 116" mask="0x00100000" name="LOCK_REGION_116"/>
          <bitfield caption="Lock Region 117" mask="0x00200000" name="LOCK_REGION_117"/>
          <bitfield caption="Lock Region 118" mask="0x00400000" name="LOCK_REGION_118"/>
          <bitfield caption="Lock Region 119" mask="0x00800000" name="LOCK_REGION_119"/>
          <bitfield caption="Lock Region 120" mask="0x01000000" name="LOCK_REGION_120"/>
          <bitfield caption="Lock Region 121" mask="0x02000000" name="LOCK_REGION_121"/>
          <bitfield caption="Lock Region 122" mask="0x04000000" name="LOCK_REGION_122"/>
          <bitfield caption="Lock Region 123" mask="0x08000000" name="LOCK_REGION_123"/>
          <bitfield caption="Lock Region 124" mask="0x10000000" name="LOCK_REGION_124"/>
          <bitfield caption="Lock Region 125" mask="0x20000000" name="LOCK_REGION_125"/>
          <bitfield caption="Lock Region 126" mask="0x40000000" name="LOCK_REGION_126"/>
          <bitfield caption="Lock Region 127" mask="0x80000000" name="LOCK_REGION_127"/>
        </register>
      </register-group>
    </module>
    <module name="CoreDebug" version="1.0.0" caption="Core Debug Register">
      <register-group name="CoreDebug" caption="Core Debug Register">
        <register name="DHCSR" offset="0x0" size="4" access-size="4" caption="Debug Halting Control and Status Register">
          <bitfield name="C_DEBUGEN" rw="RW" caption="" mask="0x1"/>
          <bitfield name="C_HALT" rw="RW" caption="" mask="0x2"/>
          <bitfield name="C_STEP" rw="RW" caption="" mask="0x4"/>
          <bitfield name="C_MASKINTS" rw="RW" caption="" mask="0x8"/>
          <bitfield name="C_SNAPSTALL" rw="RW" caption="" mask="0x20"/>
          <bitfield name="S_REGRDY" rw="R" caption="" mask="0x10000"/>
          <bitfield name="S_HALT" rw="R" caption="" mask="0x20000"/>
          <bitfield name="S_SLEEP" rw="R" caption="" mask="0x40000"/>
          <bitfield name="S_LOCKUP" rw="R" caption="" mask="0x80000"/>
          <bitfield name="S_RETIRE_ST" rw="R" caption="" mask="0x1000000"/>
          <bitfield name="S_RESET_ST" rw="R" caption="" mask="0x2000000"/>
          <bitfield name="DBGKEY" rw="W" caption="" mask="0xFFFF0000"/>
        </register>
