Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/atdf/PIC32CX5112MTG128.atdf
        <register name="MASK2" offset="0x44" rw="RW" size="4" access-size="4" caption="Mask Register 2">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
        <register name="FUNCTION2" offset="0x48" rw="RW" size="4" access-size="4" caption="Function Register 2">
          <bitfield name="FUNCTION" caption="" mask="0xF"/>
          <bitfield name="EMITRANGE" caption="" mask="0x20"/>
          <bitfield name="CYCMATCH" caption="" mask="0x80"/>
          <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
          <bitfield name="LNK1ENA" caption="" mask="0x200"/>
          <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
          <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
          <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
          <bitfield name="MATCHED" caption="" mask="0x1000000"/>
        </register>
        <register name="COMP3" offset="0x50" rw="RW" size="4" access-size="4" caption="Comparator Register 3">
        </register>
        <register name="MASK3" offset="0x54" rw="RW" size="4" access-size="4" caption="Mask Register 3">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
        <register name="FUNCTION3" offset="0x58" rw="RW" size="4" access-size="4" caption="Function Register 3">
          <bitfield name="FUNCTION" caption="" mask="0xF"/>
          <bitfield name="EMITRANGE" caption="" mask="0x20"/>
          <bitfield name="CYCMATCH" caption="" mask="0x80"/>
          <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
          <bitfield name="LNK1ENA" caption="" mask="0x200"/>
          <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
          <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
          <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
          <bitfield name="MATCHED" caption="" mask="0x1000000"/>
        </register>
      </register-group>
    </module>
    <module name="FPU" version="1.0.0" caption="Floating Point Unit">
      <register-group name="FPU" caption="Floating Point Unit">
        <register name="FPCCR" offset="0x4" rw="RW" size="4" access-size="4" initval="0xC0000000" caption="Floating-Point Context Control Register">
          <bitfield name="LSPACT" caption="" mask="0x1"/>
          <bitfield name="USER" caption="" mask="0x2"/>
          <bitfield name="THREAD" caption="" mask="0x8"/>
          <bitfield name="HFRDY" caption="" mask="0x10"/>
          <bitfield name="MMRDY" caption="" mask="0x20"/>
          <bitfield name="BFRDY" caption="" mask="0x40"/>
          <bitfield name="MONRDY" caption="" mask="0x100"/>
          <bitfield name="LSPEN" caption="" mask="0x40000000"/>
          <bitfield name="ASPEN" caption="" mask="0x80000000"/>
        </register>
        <register name="FPCAR" offset="0x8" rw="RW" size="4" access-size="4" caption="Floating-Point Context Address Register">
          <bitfield name="ADDRESS" caption="Address for FP registers in exception stack frame" mask="0xFFFFFFF8"/>
        </register>
        <register name="FPDSCR" offset="0xC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Floating-Point Default Status Control Register">
          <bitfield name="RMODE" caption="Default value for FPSCR.RMODE" mask="0xC00000" values="FPU_FPDSCR__RMODE"/>
          <bitfield name="FZ" caption="Default value for FPSCR.FZ" mask="0x1000000"/>
          <bitfield name="DN" caption="Default value for FPSCR.DN" mask="0x2000000"/>
          <bitfield name="AHP" caption="Default value for FPSCR.AHP" mask="0x4000000"/>
        </register>
        <register name="MVFR0" offset="0x10" rw="R" size="4" access-size="4" caption="Media and FP Feature Register 0">
          <bitfield name="A_SIMD_registers" caption="" mask="0xF"/>
          <bitfield name="Single_precision" caption="" mask="0xF0"/>
          <bitfield name="Double_precision" caption="" mask="0xF00"/>
          <bitfield name="FP_excep_trapping" caption="" mask="0xF000"/>
          <bitfield name="Divide" caption="" mask="0xF0000"/>
          <bitfield name="Square_root" caption="" mask="0xF00000"/>
          <bitfield name="Short_vectors" caption="" mask="0xF000000"/>
          <bitfield name="FP_rounding_modes" caption="" mask="0xF0000000"/>
        </register>
        <register name="MVFR1" offset="0x14" rw="R" size="4" access-size="4" caption="Media and FP Feature Register 1">
          <bitfield name="FtZ_mode" caption="" mask="0xF"/>
          <bitfield name="D_NaN_mode" caption="" mask="0xF0"/>
          <bitfield name="FP_HPFP" caption="" mask="0xF000000"/>
          <bitfield name="FP_fused_MAC" caption="" mask="0xF0000000"/>
        </register>
      </register-group>
      <value-group name="FPU_FPDSCR__RMODE">
        <value name="RN" caption="Round to Nearest" value="0x0"/>
        <value name="RP" caption="Round towards Positive Infinity" value="0x1"/>
        <value name="RM" caption="Round towards Negative Infinity" value="0x2"/>
        <value name="RZ" caption="Round towards Zero" value="0x3"/>
      </value-group>
    </module>
    <module name="ITM" version="1.0.0" caption="Instrumentation Trace Macrocell">
      <register-group name="ITM" caption="Instrumentation Trace Macrocell">
        <register name="PORT" offset="0x0" rw="W" size="4" access-size="4" count="32" caption="ITM Stimulus Port Registers">
          <mode name="WORD"/>
          <mode name="BYTE"/>
          <mode name="HWORD"/>
          <bitfield modes="BYTE" name="PORT" caption="" mask="0xFF"/>
          <bitfield modes="HWORD" name="PORT" caption="" mask="0xFFFF"/>
          <bitfield modes="WORD" name="PORT" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="TER" offset="0xE00" rw="RW" size="4" access-size="4" caption="ITM Trace Enable Register">
        </register>
        <register name="TPR" offset="0xE40" rw="RW" size="4" access-size="4" caption="ITM Trace Privilege Register">
          <bitfield name="PRIVMASK" caption="" mask="0xF"/>
        </register>
        <register name="TCR" offset="0xE80" rw="RW" size="4" access-size="4" caption="ITM Trace Control Register">
          <bitfield name="ITMENA" caption="" mask="0x1"/>
          <bitfield name="TSENA" caption="" mask="0x2"/>
          <bitfield name="SYNCENA" caption="" mask="0x4"/>
          <bitfield name="DWTENA" caption="" mask="0x8"/>
          <bitfield name="SWOENA" caption="" mask="0x10"/>
          <bitfield name="STALLENA" caption="" mask="0x20"/>
          <bitfield name="TSPrescale" caption="" mask="0x300"/>
          <bitfield name="GTSFREQ" caption="" mask="0xC00"/>
          <bitfield name="TraceBusID" caption="" mask="0x7F0000"/>
          <bitfield name="BUSY" caption="" mask="0x800000"/>
        </register>
        <register name="IWR" offset="0xEF8" rw="W" size="4" access-size="4" caption="ITM Integration Write Register">
          <bitfield name="ATVALIDM" caption="" mask="0x1"/>
        </register>
        <register name="IRR" offset="0xEFC" rw="R" size="4" access-size="4" caption="ITM Integration Read Register">
          <bitfield name="ATREADYM" caption="" mask="0x1"/>
        </register>
      </register-group>
    </module>
    <module name="MPU" version="1.0.0" caption="Memory Protection Unit">
      <register-group name="MPU" caption="Memory Protection Unit">
        <register name="TYPE" offset="0x0" rw="R" size="4" access-size="4" caption="MPU Type Register">
          <bitfield name="SEPARATE" caption="Separate instruction and Data Memory MapsRegions" mask="0x1"/>
          <bitfield name="DREGION" caption="Number of Data Regions" mask="0xFF00"/>
          <bitfield name="IREGION" caption="Number of Instruction Regions" mask="0xFF0000"/>
        </register>
        <register name="CTRL" offset="0x4" rw="RW" size="4" access-size="4" caption="MPU Control Register">
          <bitfield name="ENABLE" caption="MPU Enable" mask="0x1"/>
          <bitfield name="HFNMIENA" caption="Enable Hard Fault and NMI handlers" mask="0x2"/>
          <bitfield name="PRIVDEFENA" caption="Enables privileged software access to default memory map" mask="0x4"/>
        </register>
